/*Напишіть програму, яка виводить усі парні числа від 1 до N, де
N - введене число користувача. Також наприкінці вивести суму парних чисел, 
 загальну суму всіх чисел та суму непарних. Потім їх скласти між собою, привести 
 до дробного типу, поділити на 2 і вивести результат.*/


 #include <iostream>
 using namespace std;
 int main()
 {
 setlocale(0,".1251");
 int N;
cout<<"Введіть число N:";
cin>>N;
int sumEven=0; //Сума парних чисел
int sumOdd=0; // Сума непарних чисел
int sumTotal=0; //Загальна сума чисел

cout<<"Парні числа від 1 до"<<N<<":";
for(int i=1; i<=N; i++ ){
    sumTotal+=1; //Додаємо кожне число до загальної суми
if(i%2==0) {
    sumEven +=i; //Якщо число парне, додаємо до суми парних
    cout<<i<<" ";
} else {
    sumOdd +=i; //Якщо число непарне, додаємо до суми чисел
}
}
cout<<endl;

//Виводимо результати
cout<<"Сума парних чисел:"<<sumEven<<endl;
cout<<"Сума непарних чисел:"<<sumOdd<<endl;
cout<<"Загальна сума числе:"<<sumTotal<<endl;

//Складемо суми і приводимо результат до дробного типу 
double result = (sumEven+sumOdd+sumTotal)/2.0;
cout<<"Результат:";

return 0;
 }